{
  "backend/main.mo": "Defines product, collection, and contact types, initializes catalog data, and stores products, collections, and messages in in-memory maps and lists.",
  "feature_evidence.json": "Describes feature evidence for frontend image mapping fixes and asset validation, listing related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Provides prewritten summaries of all major frontend files, including pages, components, hooks, and configuration assets.",
  "frontend/index.css": "Sets global Tailwind CSS layers and defines extensive color variables for light and dark themes using OKLCH values.",
  "frontend/index.html": "Basic HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router routes and initializes the backend actor, wrapping the app in a CartProvider.",
  "frontend/src/components/cart/CartProvider.tsx": "Simple wrapper that renders children without adding logic, serving as a placeholder provider.",
  "frontend/src/components/feedback/ErrorState.tsx": "Displays a styled error message with optional retry button and destructive-themed visuals.",
  "frontend/src/components/feedback/LoadingState.tsx": "Shows a loading spinner with a customizable loading message.",
  "frontend/src/components/forms/ContactForm.tsx": "Implements a contact form with validation, submission via mutation hook, and success/error feedback UI.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the main site layout with header, textured background, content wrapper, and a branded footer.",
  "frontend/src/components/nav/HeaderNav.tsx": "Responsive header navigation with links, cart button, and mobile menu toggle using cart state and router.",
  "frontend/src/components/theme/TextureBackground.tsx": "Renders a fixed repeating grunge-texture background layer with low opacity.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user’s identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useCart.ts": "Zustand‑based persistent cart store with item add/remove, quantity updates, and subtotal/total calculations.",
  "frontend/src/hooks/useContactSubmission.ts": "Mutation hook that sends contact form data to the backend via the current actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth state, login, logout, and identity loading via an auth client provider.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching collections, products, and individual product details using the actor.",
  "frontend/src/index.css": "Tailwind setup defining light/dark theme variables, fonts, and global utility styles.",
  "frontend/src/lib/imagePaths.ts": "Maps product image keys to generated asset paths with fallback and helpers for resolving image arrays.",
  "frontend/src/main.tsx": "Entrypoint that mounts the app with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with brand story, design pillars, and mission statement sections.",
  "frontend/src/pages/CartPage.tsx": "Provides a shopping cart interface with item listing, quantity controls, subtotal display, and empty-cart fallback.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact details, business hours, and a contact form for user inquiries.",
  "frontend/src/pages/HomePage.tsx": "Implements the homepage with hero banner, feature highlights, and links to shop and about pages.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Shows detailed product info including images, description, tags, quantity selection, and add‑to‑cart behavior.",
  "frontend/src/pages/ShopPage.tsx": "Lists products with optional collection filtering and handles loading and error states.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom fonts, OKLCH color tokens, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing a clothing website plan, known UI/image issues, and a large list of required product images for the build."
}