{
  "backend/main.mo": "Motoko canister defining product, collection, and contact types with in‑memory maps and initialization plus query methods for fetching collections and filtered products.",
  "feature_evidence.json": "Feature evidence report listing frontend files, components, and test IDs tied to visual‑theme updates and new static asset integration.",
  "frontend-file-summaries.txt": "Mapping of frontend file paths to short summaries describing each component, hook, page, and style configuration.",
  "frontend/index.css": "Tailwind base/theme setup defining OKLCH color variables and dark mode variants for the site’s aesthetic.",
  "frontend/index.html": "HTML entry point loading the React app root and main TypeScript bundle.",
  "frontend/src/App.tsx": "Main React router configuration wiring all pages and initializing the backend actor on load.",
  "frontend/src/components/cart/CartProvider.tsx": "Wrapper component that simply renders children while serving as cart provider placeholder.",
  "frontend/src/components/feedback/ErrorState.tsx": "Reusable error UI with icon, message display, and optional retry button.",
  "frontend/src/components/feedback/LoadingState.tsx": "Loading indicator component showing a spinning icon and status message.",
  "frontend/src/components/forms/ContactForm.tsx": "Contact form with validation, submission via mutation hook, and success/error handling states.",
  "frontend/src/components/layout/SiteLayout.tsx": "App layout with background texture, header nav, main content wrapper, and branded footer.",
  "frontend/src/components/nav/HeaderNav.tsx": "Responsive header navigation with links, branding, a cart button showing item count, and a toggleable mobile menu.",
  "frontend/src/components/theme/TextureBackground.tsx": "Renders a fixed repeating grunge texture background layer with low opacity.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useCart.ts": "Zustand store persisting cart items with helpers for modifying quantities and calculating totals.",
  "frontend/src/hooks/useContactSubmission.ts": "Mutation hook that submits contact messages through the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login state and loading identities.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching collections, product lists, and individual products from the backend actor.",
  "frontend/src/index.css": "Tailwind setup with custom light/dark theme variables, fonts, and base styles.",
  "frontend/src/lib/imagePaths.ts": "Maps product image keys to asset paths with helpers to resolve single or multiple images.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity provider before rendering the app.",
  "frontend/src/pages/AboutPage.tsx": "Static About page describing the brand mission with styled sections and icons.",
  "frontend/src/pages/CartPage.tsx": "Renders the shopping cart with item listing, quantity controls, subtotal, and empty-cart fallback.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact info, business hours, and a contact form for sending messages.",
  "frontend/src/pages/HomePage.tsx": "Shows the homepage hero section, feature highlights, and brand messaging with links to shop and about pages.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Fetches and displays product details with images, tags, quantity controls, and add‑to‑cart functionality.",
  "frontend/src/pages/ShopPage.tsx": "Loads collections and products, allowing filtering by collection and linking to individual product pages.",
  "frontend/tailwind.config.js": "Configures Tailwind theme settings, custom colors, fonts, animations, and plugin usage.",
  "project_state.json": "Defines the project’s current build state, including theme goals, image requirements, and a list of implemented features for a stylized clothing website. Contains metadata, versioning, and existing functionality descriptions."
}