{
  "kind": "build_request",
  "title": "Fix missing/duplicate product images and align product labels with displayed photos",
  "projectName": "Rebel Denim Storefront",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-16",
      "text": "Audit and correct the frontend product image key-to-asset mapping so every product image key used by the backend catalog resolves to the intended static asset path and does not incorrectly reuse another product’s image.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "No most pictures did not show up, they also had several duplicate and the labels didn’t describe the actual photo of the clothing."
        ]
      },
      "acceptanceCriteria": [
        "For every Product.images key returned by the backend, getProductImagePath(key) resolves to the correct /assets/generated/*.png path for that product (no incorrect cross-mapping like mapping a cap/belt/skirt to an unrelated asset).",
        "Eliminate unintended duplicate mappings where multiple different product image keys point to the same asset file (duplicates are allowed only for deliberate multi-angle images of the same product).",
        "Shop page grid images and Product Details gallery images render consistently using the corrected mapping without showing the wrong garment type for the product name."
      ]
    },
    {
      "id": "REQ-17",
      "text": "Ensure all product image assets referenced by the frontend image mapping exist under frontend/public/assets/generated and load successfully in the UI (no broken images).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "No most pictures did not show up"
        ]
      },
      "acceptanceCriteria": [
        "All referenced files under /assets/generated/ return HTTP 200 in the deployed app and render in <img> tags on both Shop and Product Details pages.",
        "No product card on the Shop page renders a broken image icon; each product shows its intended primary image.",
        "Product Details pages show the correct number of images based on Product.images length and each thumbnail loads successfully."
      ]
    },
    {
      "id": "REQ-18",
      "text": "Audit and update seeded backend product catalog entries so product names/descriptions match the clothing depicted by their associated image keys, and each product’s image keys correspond to the correct assets in the frontend mapping.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "the labels didn’t describe the actual photo of the clothing."
        ]
      },
      "acceptanceCriteria": [
        "For every seeded product in backend/main.mo, the Product.name and Product.description match the garment type depicted by the resolved image assets (e.g., hats are labeled as hats; belts as belts; skirts as skirts; jackets as jackets).",
        "Each product’s images array contains only valid image keys present in frontend/src/lib/imagePaths.ts.",
        "After updates, browsing the Shop page and opening Product Details shows labels that match the displayed clothing images (no obvious mismatches)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit files under frontend/src/components/ui or any paths listed as immutable in SYSTEM_CONTEXT.",
    "Serve product images as static assets from frontend/public/assets/generated (do not route images through the backend)."
  ],
  "nonGoals": [
    "Adding new product filtering/search features.",
    "Integrating any external image hosting/CDN or third-party asset pipelines.",
    "Changing the overall site theme or page structure beyond what is required to fix image rendering and label-to-image alignment."
  ],
  "imageRequirements": {
    "required": [
      "Flat-lay product photo: tattoo-flash graphic T-shirt design with distressed ink texture, black/cream/gold palette (product-new-design-01.dim_1200x1200.png)",
      "Flat-lay product photo: embroidered hoodie with ornate wing/cross motifs, distressed denim accents (product-new-design-02.dim_1200x1200.png)",
      "Flat-lay product photo: embellished jeans with rhinestone flourishes and western stitching (product-new-design-03.dim_1200x1200.png)",
      "Flat-lay product photo: denim jacket with large back patch in tattoo-flash style, distressed wash (product-new-design-04.dim_1200x1200.png)",
      "Flat-lay product photo: trucker hat with bold patch and worn texture (product-new-design-05.dim_1200x1200.png)",
      "Flat-lay product photo: leather belt with ornate metal buckle and engraved detailing (product-new-design-06.dim_1200x1200.png)",
      "Flat-lay product photo: long-sleeve tee with vintage rock poster illustration, distressed print (product-new-design-07.dim_1200x1200.png)",
      "Flat-lay product photo: flannel overshirt with embroidered tattoo-style rose and dagger motif (product-new-design-08.dim_1200x1200.png)",
      "Flat-lay product photo: sleeveless tank with halo/serpent illustration, gritty screenprint (product-new-design-09.dim_1200x1200.png)",
      "Flat-lay product photo: mini skirt with dark ornamental filigree pattern, distressed fabric texture (product-new-design-10.dim_1200x1200.png)",
      "Flat-lay product photo: varsity-style jacket with oversized embroidered crest and worn satin sheen (product-new-design-11.dim_1200x1200.png)",
      "Flat-lay product photo: workwear pants with chain-stitch embroidery and patched distressing (product-new-design-12.dim_1200x1200.png)",
      "Flat-lay product photo: graphic tee featuring the words “Living Off Experience” in bold vintage tattoo lettering, distressed ink (product-living-off-experience-01.dim_1200x1200.png)",
      "Flat-lay product photo: hoodie featuring the words “Living Off Experience” with ornate flourishes, embroidered look (product-living-off-experience-02.dim_1200x1200.png)",
      "Flat-lay product photo: denim jacket back graphic featuring “Living Off Experience” typography with winged crest, distressed denim (product-living-off-experience-03.dim_1200x1200.png)",
      "Flat-lay product photo: jeans pocket embroidery featuring “Living Off Experience” micro-lettering and filigree (product-living-off-experience-04.dim_1200x1200.png)",
      "Flat-lay product photo: trucker hat patch reading “Living Off Experience” with worn stitching (product-living-off-experience-05.dim_1200x1200.png)",
      "Flat-lay product photo: belt buckle engraving featuring “Living Off Experience” with laurel/scrollwork (product-living-off-experience-06.dim_1200x1200.png)",
      "Flat-lay product photo: long-sleeve tee featuring “Living Off Experience” with vintage banner and rose elements, distressed print (product-living-off-experience-07.dim_1200x1200.png)",
      "Flat-lay product photo: flannel overshirt embroidery featuring “Living Off Experience” banner + dagger motif (product-living-off-experience-08.dim_1200x1200.png)",
      "Flat-lay product photo: tank top with “Living Off Experience” hand-lettered script and gritty halftone shading (product-living-off-experience-09.dim_1200x1200.png)",
      "Flat-lay product photo: skirt or shorts with woven label reading “Living Off Experience”, distressed fabric texture (product-living-off-experience-10.dim_1200x1200.png)"
    ],
    "edits": []
  }
}